window.onload = function () {

    displayDataList(0);
}

function displayDataList(columnNo) {
    var header = document.getElementById('table-header');

    var root = document.getElementById('table-root');

    // alert(root.childElementCount);

    // element.textContent = null;

    var list = getSourceList();

    list.sort(function (a, b) {
        let a_ = a.split('*')[columnNo];
        let b_ = b.split('*')[columnNo];
        return Number(b_) - Number(a_);
    });

    for (var i = 0; i < list.length; i++) {
        let args = list[i].split('*');
        let no = args[0];
        let release = args[1];
        let title = args[2];
        let read = args[3];
        let signature = args[4];
        let scale = args[5];
        let bpm = args[6];
        let url = args[7];
        let html = `
            <tr class="table-element">
                <td>${no}</td>
                <td>${release}</td>
                <td class="name">${title}</td>
                <td class="name">${read}</td>
                <td>${signature}</td>
                <td class="${scale == '長調' ? 'dur' : 'moll'}">${scale}</td>
                <td>${bpm}</td>
                <td><a href="src.html?${url}">コード表示</a></td>
            </tr>
        `;
        header.insertAdjacentHTML('afterend', html);
    }

}

function sort() {

    var element = document.getElementById('table-header');

    element.parentElement.insertBefore(element, element.nextElementSibling);
    // while (element.nextElementSibling) {
    //     element.parentElement.removeChild(element.nextElementSibling);
    // }
    
    // displayDataList(6);
}


function getSourceList() {
    var list = new Array(
        '0*2012*I can\'t take...* あいきゃんとていく *♭*長調* 122 * ican',
        '1*2008*愛に似てる*あいににてる*####*短調*100*aininiteru',
        '2*2010*アオゾラ カナタ*あおぞらかなた*#####*長調*113*aozora',
        '3*1999*A crown*あくらうん*##*短調*100*crown',
        '4*2009*As the Dew*あずざでゅー*####*長調*116*asthedew',
        '5*2009*雨上がりのBlue*あめあがりのぶるー*♭♭♭♭*長調*112*ameagari',
        '6*2009*Argentina*あるへんてぃーな*#*短調*155*argentina',
        '7*2009*Yellow Moon*いえろーむーん*なし*短調*90*yellow',
        '8*2009*一番素敵だった日*いちばんすてきだったひ*なし*長調*100*suteki',
        '9*2009*一緒に暮らそう*いっしょにくらそう*#*短調*111*isshoni',
        '10*2009*いつかまた会いましょう*いつかまたあいましょう*#*長調*100*itukamata',
        '11*2009*in little time*いんりとるたいむ*#*長調*120*inlittle',
        '12*2009*WEEKEND*うぃーくえんど*なし*長調*88*weekend',
        '13*2009*wish★*うぃっしゅ*なし*長調*112*wish',
        '14*2009*失われた物語*うしなわれたものがたり*なし*短調*100*ushinawareta',
        '15*2009*海をゆく獅子*うみをゆくしし*なし*短調*121*umiwoyuku',
        '16*2009*英雄*えいゆう*なし*短調*100*eiyu',
        '17*2009*Anywhere*えにーうぇあー*なし*短調*100*anywhere',
        '18*2009*Elysium*えりゅーしおん*なし*短調*100*elysium',
        '19*2009*Endless Desire*えんどれすでざいあ*なし*短調*100*endless',
        '20*2009*Over Drive*おーばーどらいぶ*なし*長調*100*overdrive',
        '21*2009*over blow*おーばーぶろー*なし*長調*100*overblow',
        '22*2009*ON THE WAY*おんざうぇい*なし*長調*100*ontheway',
        '23*2009*Only Stay*おんりーすてい*なし*短調*100*hoge',
        '24*2009*鏡にみた夢*かがみにみたゆめ*なし*短調*100*hoge',
        '25*2009*かくれんぼ*かくれんぼ*なし*長調*100*hoge',
        '26*2009*風とRAINBOW*かぜとれいんぼー*なし*長調*100*hoge',
        '27*2009*風の音だけをきいて*かぜのおとだけをきいて*なし*長調*100*hoge',
        '28*2009*風の中のオルゴール*かぜのなかのおるごーる*なし*短調*100*hoge',
        '29*2009*彼方まで光を*かなたまでひかりを*なし*長調*100*hoge',
        '30*2009*君 連れ去る時の訪れを*きみつれさるときのおとずれを*なし*長調*100*hoge',
        '31*2009*君という光*きみというひかり*なし*長調*100*hoge',
        '32*2009*君の家に着くまでずっと走ってゆく*きみのうちにつくまでずっとはしってゆく*なし*長調*100*hoge',
        '33*2009*君の思い描いた夢 集メル HEAVEN*きみのおもいえがいたゆめあつめるへぶん*なし*長調*100*hoge',
        '34*2009*君を飾る花を咲かそう*きみをかざるはなをさかそう*なし*長調*100*hoge',
        '35*2009*CANDY POP*きゃんでぃーぽっぷ*なし*長調*100*hoge',
        '36*2009*今日と明日と*きょうとあしたと*なし*長調*100*hoge',
        '37*2009*今日の君と明日を待つ*きょうのきみとあすをまつ*なし*長調*100*hoge',
        '38*2009*Crier Girl & Crier Boy ～ice cold sky～*くらいあーがーるくらいあーぼーいあいすこーるどすかい*なし*長調*100*hoge',
        '39*2009*Cried a little*くらいどありとる*なし*短調*100*hoge',
        '40*2009*クリスタル・ゲージ*くりすたるげーじ*なし*長調*100*hoge',
        '41*2009*closer*くろーざー*なし*長調*100*hoge',
        '42*2009*Clockwork*くろっくわーくす*なし*短調*100*hoge',
        '43*2009*call my name*こーるまいねーむ*なし*長調*100*hoge',
        '44*2009*恋することしか出来ないみたいに*こいすることしかできないみたいに*なし*短調*100*hoge',
        '45*2009*恋のあいまに*こいのあいまに*なし*長調*100*hoge',
        '46*2009*幸福なペット*こうふくなぺっと*なし*長調*100*hoge',
        '47*2009*この手を伸ばせば*このてをのばせば*なし*長調*100*hoge',
        '48*2009*この冬の白さに*このふゆのしろさに*なし*短調*100*hoge',
        '49*2009*今宵エデンの片隅で*こよいえでんのかたすみで*なし*長調*100*hoge',
        '50*2009*Go For It*ごーふぉーいっと*なし*長調*100*hoge',
        '51*2009*Circle Days*さーくるでいず*なし*短調*100*hoge',
        '52*2009*最後の離島*さいごのりとう*なし*短調*100*hoge',
        '53*2009*「さよなら」とたった一言で…*さよならとたったひとことで*なし*長調*100*hoge',
        '54*2009*The Crack-up*ざくらっくあっぷ*なし*短調*100*hoge',
        '55*2009*The Someone\'s Tale * ざさむわんずている * なし * 長調 * 100 * hoge',
        '56*2009*The first cry*ざふぁーすとくらい*なし*短調*100*hoge',
        '57*2009*Secret Path*しーくれっとぱす*なし*長調*100*hoge',
        '58*2009*白い空*しろいそら*なし*長調*100*hoge',
        '59*2009*Jewel Fish*じゅえるふぃっしゅ*なし*長調*100*hoge',
        '60*2009*JUDY*じゅでぃ*なし*短調*100*hoge',
        '61*2009*Sky*すかい*なし*短調*100*hoge',
        '62*2009*スカイ・ブルー*すかいぶるー*なし*長調*100*hoge',
        '63*2009*Stay*すてい*なし*長調*100*hoge',
        '64*2009*strangers*すとれんじゃーず*なし*長調*100*hoge',
        '65*2009*スパイラル*すぱいらる*なし*長調*100*hoge',
        '66*2009*Smiley Nation*すまいりーねーしょん*なし*長調*100*hoge',
        '67*2009*静寂のconcerto*せいじゃくのこんちぇると*なし*短調*100*hoge',
        '68*2009*世界はまわると言うけれど*せかいはまわるというけれど*なし*長調*100*hoge',
        '69*2009*千以上の言葉を並べても…*せんいじょうのことばをならべても*なし*長調*100*hoge',
        '70*2009*創世記I*そうせいきいち*なし*長調*100*hoge',
        '71*2009*空色の猫*そらいろのねこ*なし*長調*100*hoge',
        '72*2009*空に花火*そらにはなび*なし*長調*100*hoge',
        '73*2009*Timing*たいみんぐ*なし*長調*100*hoge',
        '74*2009*Timeless Sleep*たいむれすすりーぷ*なし*長調*100*hoge',
        '75*2009*たとえば12月の夜に*たとえばじゅうにがつのよるに*なし*長調*100*hoge',
        '76*2009*doubt*だうと*なし*短調*100*hoge',
        '77*2009*冷たい影*つめたいかげ*なし*短調*100*hoge',
        '78*2009*tell me something*てるみーさむしんぐ*なし*長調*100*hoge',
        '79*2009*トランス・トラップ*とらんすとらっぷ*なし*短調*100*hoge',
        '80*2009*trade*とれーど*なし*長調*100*hoge',
        '81*2009*永遠に葬れ*とわにほうむれ*なし*長調*100*hoge',
        '82*2009*永遠を駆け抜ける一瞬の僕ら*とわをかけぬけるいっしゅんのぼくら*なし*長調*100*hoge',
        '83*2009*Doing all right*どぅーいんぐおーるらいと*なし*長調*100*hoge',
        '84*2009*dreaming of love*どりーみんぐおぶらぶ*なし*短調*100*hoge',
        '85*2009*渚とシークレットデイズ*なぎさとしーくれっとでいず*なし*長調*100*hoge',
        '86*2009*泣けない夜も 泣かない朝も*なけないよるもなかないあさも*なし*長調*100*hoge',
        '87*2009*夏の終わりの長い雨*なつのおわりのながいあめ*なし*長調*100*hoge',
        '88*2009*夏の幻*なつのまぼろし*なし*長調*100*hoge',
        '89*2009*涙のイエスタデー*なみだのいえすたでー*なし*長調*100*hoge',
        '90*2009*nonsense*なんせんす*なし*長調*100*hoge',
        '91*2009*Naked Story*ねいきっどすとーりー*なし*長調*100*hoge',
        '92*2009*逃れの町*のがれのまち*なし*長調*100*hoge',
        '93*2009*Nostalgia*のすたるじあ*なし*長調*100*hoge',
        '94*2009*Nora*のら*なし*長調*100*hoge',
        '95*2009*hi-speed スペシャル oneday*はいすぴーどすぺしゃるわんでい*なし*長調*100*hoge',
        '96*2009*Happy swallow*はっぴーすわろー*なし*長調*100*hoge',
        '97*2009*HAPPY DAYS?*はっぴーでいず*なし*長調*100*hoge',
        '98*2009*八月の夜*はちがつのよる*なし*長調*100*hoge',
        '99*2009*花は咲いて ただ揺れて*はなはさいてただゆれて*なし*長調*100*hoge',
        '100*2009*春待つ花のように*はるまつはなのように*なし*長調*100*hoge',
        '101*2009*晴れ時計*はれどけい*なし*長調*100*hoge',
        '102*2009*Hello Sadness*はろーさどねす*なし*長調*100*hoge',
        '103*2009*バタフライ・ノット*ばたふらいのっと*なし*長調*100*hoge',
        '104*2009*His Voyage*ひずぼやーじゅ*なし*長調*100*hoge',
        '105*2009*日々のほとり*ひびのほとり*なし*長調*100*hoge',
        '106*2009*向日葵の色*ひまわりのいろ*なし*長調*100*hoge',
        '107*2009*百年の孤独*ひゃくねんのこどく*なし*長調*100*hoge',
        '108*2009*P.S GIRL*ぴーえすがーる*なし*長調*100*hoge',
        '109*2009*picture of world*ぴくちゃーおぶわーるど*なし*長調*100*hoge',
        '110*2009*fill away*ふぃるあうぇい*なし*長調*100*hoge',
        '111*2009*For South*ふぉーさうす*なし*長調*100*hoge',
        '112*2009*Fall in Life ～Hallelujah～*ふぉーるいんらいふはれるや*なし*長調*100*hoge',
        '113*2009*ふたり*ふたり*なし*長調*100*hoge',
        '114*2009*二人のロケット*ふたりのろけっと*なし*長調*100*hoge',
        '115*2009*flying*ふらいんぐ*なし*長調*100*hoge',
        '116*2009*Flower*ふらわー*なし*長調*100*hoge',
        '117*2009*Float World*ふろーとわーるど*なし*長調*100*hoge',
        '118*2009*ブルーの森で*ぶるーのもりで*なし*長調*100*hoge',
        '119*2009*blue bird*ぶるーばーど*なし*長調*100*hoge',
        '120*2009*Blue Regret*ぶるーりぐれっと*なし*長調*100*hoge',
        '121*2009*Please, forgive me*ぷりーずふぉーぎぶみー*なし*長調*100*hoge',
        '122*2009*pray*ぷれい*なし*長調*100*hoge',
        '123*2009*Holy ground*ほーりーぐらうんど*なし*長調*100*hoge',
        '124*2009*Holding you, and swinging*ほーるでぃんぐゆーあんどすうぃんぐいんぐ*なし*長調*100*hoge',
        '125*2009*whiteout*ほわいとあうと*なし*長調*100*hoge',
        '126*2009*僕らだけの未来*ぼくらだけのみらい*なし*長調*100*hoge',
        '127*2009*マージナルマン*まーじなるまん*なし*長調*100*hoge',
        '128*2009*祭りのじかん*まつりのじかん*なし*長調*100*hoge',
        '129*2009*まぼろし*まぼろし*なし*長調*100*hoge',
        '130*2009*迷いの森*まよいのもり*なし*長調*100*hoge',
        '131*2009*Marionette Fantasia*まりおねっとふぁんたじあ*なし*長調*100*hoge',
        '132*2009*廻り道*まわりみち*なし*長調*100*hoge',
        '133*2009*未完成な音色*みかんせいなねいろ*なし*長調*100*hoge',
        '134*2009*短い夏*みじかになつ*なし*長調*100*hoge',
        '135*2009*Mr.Holiday*みすたーほりでー*なし*長調*100*hoge',
        '136*2009*Misty Mystery*みすてぃーみすてりー*なし*長調*100*hoge',
        '137*2009*Mysterious Eyes*みすてりあすあいず*なし*長調*100*hoge',
        '138*2009*水のない晴れた海へ*みずのないはれたうみへ*なし*長調*100*hoge',
        '139*2009*Maizy*めいじー*なし*長調*100*hoge',
        '140*2009*巡り来る春に*めぐりくるはるに*なし*長調*100*hoge',
        '141*2009*メモリーズ*めもりーず*なし*長調*100*hoge',
        '142*2009*もう一度 笑って*もいちどわらって*なし*長調*100*hoge',
        '143*2009*もうちょっとサガシテみましょう*もうちょっとさがしてみましょう*なし*長調*100*hoge',
        '144*2009*やさしい雨*やさしいあめ*なし*長調*100*hoge',
        '145*2009*U*ゆー*なし*長調*100*hoge',
        '146*2009*夕立の庭*ゆうだちのにわ*なし*長調*100*hoge',
        '147*2009*夕月夜*ゆうづきよ*なし*長調*100*hoge',
        '148*2009*夢のひとつ*ゆめのひとつ*なし*長調*100*hoge',
        '149*2009*夢・花火*ゆめはなび*なし*長調*100*hoge',
        '150*2009*夢みたあとで*ゆめみたあとで*なし*長調*100*hoge',
        '151*2009*夜深けの流星達*よふけのりゅうせいたち*なし*長調*100*hoge',
        '152*2009*Life goes on!*らいふごーずおん*なし*長調*100*hoge',
        '153*2009*live*りぶ*なし*長調*100*hoge',
        '154*2009*籟・来・也*らいらいや*なし*長調*100*hoge',
        '155*2009*Rusty Rail*らすてぃーれいる*なし*長調*100*hoge',
        '156*2009*Last love song*らすとらぶそんぐ*なし*長調*100*hoge',
        '157*2009*Love is a Bird*らぶいずあばーど*なし*長調*100*hoge',
        '158*2009*Love Lone Star*らぶろーんすたー*なし*長調*100*hoge',
        '159*2009*la-la-la それから 1・2・3*らららそれからわんつーすりー*なし*長調*100*hoge',
        '160*2009*Rhythm*りずむ*なし*長調*100*hoge',
        '161*2009*Ring Ring a ding*りんぐりんぐあでぃん*なし*長調*100*hoge',
        '162*2009*lose feeling*るーずふぃーりんぐ*なし*長調*100*hoge',
        '163*2009*Rainy Soul*れいにーそうる*なし*長調*100*hoge',
        '164*2009*ロンリーナイト*ろんりーないと*なし*長調*100*hoge',
        '165*2009*忘れ咲き*わすれざき*なし*長調*100*hoge',
        '166*2009*wonder land*わんだーらんど*なし*長調*100*hoge'
    );

    return list;
}